Revit 2026 API

# FloorTypeThermalProperties Property

---

The calculated and settable thermal properties of the FloorType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ThermalProperties ThermalProperties { get; }
```
```vb
Public ReadOnly Property ThermalProperties As ThermalProperties
	Get
```
```cpp
public:
property ThermalProperties^ ThermalProperties {
	ThermalProperties^ get ();
}
```
```fsharp
member ThermalProperties : ThermalProperties with get
```

#### Property Value

ThermalProperties

| Exception | Condition |
| --- | --- |
| InvalidOperationException | the floor does not have thermal properties. |

#### Reference

FloorType Class

Autodesk.Revit.DB Namespace